Revit 2026 API

# AssetPropertyRemoveConnectedAsset Method

---

Removes the connected asset attached to this asset property if any.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveConnectedAsset()
```
```vb
Public Sub RemoveConnectedAsset
```
```cpp
public:
void RemoveConnectedAsset()
```
```fsharp
member RemoveConnectedAsset : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The asset property is not editable. -or- Cannot check validity for a property not being edited in AppearanceAssetEditScope. |

#### Reference

AssetProperty Class

Autodesk.Revit.DB.Visual Namespace